DataProcessors/ЗагрузкаМорозилокИзТаблиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаМорозилокИзТаблиц</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидОперацииМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидОперацииМорозилок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипМестаМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипМестаМорозилок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НашСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ремонт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДвижениеМорозилок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДвижениеМорозилок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМорозилок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипМестаМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КудаТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипМестаМорозилок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КудаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Морозилки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Морозилка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Морозилки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Морозилки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Морозилки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаМорозилокИзТаблиц/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура НачатьЗагрузку()
	СтруктураПараметров = Новый Структура;
	
	ОписаниеОповещенияВозврата = Новый ОписаниеОповещения("ЗагрузкаИзФайлаПосле", ЭтотОбъект); 
	
	СтруктураПараметров.Вставить("Заголовок", "Загрузка морозилок"""); 
	СтруктураПараметров.Вставить("Колонки", Новый Массив);
	
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения, ПоЧемуИскать", 
															"ИнвНом",
															Новый ОписаниеТипов("Строка"),
															"Инв. №",
															"Инв. №",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"ЗавНом",
															Новый ОписаниеТипов("Строка"),
															"Зав. №",
															"Зав. №",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"ТипМК",
															Новый ОписаниеТипов("Строка"),
															"Тип МК",
															"Тип МК",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"залоговая",
															Новый ОписаниеТипов("Число"),
															"залоговая",
															"залоговая",
															Истина
														)
										);
										
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"Год",
															Новый ОписаниеТипов("Дата"),
															"Год",
															"Год",
															Истина
														)
										);									
										
	ЗагрузкаДанныхИзТаблицКлиент.ОткрытьФормуЗагрузкиИзТаблиц(СтруктураПараметров, ЭтаФорма, ОписаниеОповещенияВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзФайлаПосле(СтруктураПараметров, ДополнительныеПараметры) Экспорт  
	
	Если ЗначениеЗаполнено(СтруктураПараметров) Тогда 
		Адрес = СтруктураПараметров.АдресВременногоХранилищаТаблицы; 
		ЗагрузитьТаблицуНаСервере(Адрес);  	
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьТаблицуНаСервере(Адрес) 

	ТаблицаКЗагрузке = ПолучитьИзВременногоХранилища(Адрес);  
	 
	Для каждого Строка из ТаблицаКЗагрузке цикл 
		НМорозилка = Справочники.Морозилки.СоздатьЭлемент();
		НМорозилка.Наименование = "Морозильная камера";
		НМорозилка.ТипМК = Строка.ТипМК;
		НМорозилка.ЗалоговаяСтоимость = Строка.Залоговая;
		НМорозилка.ИнвентарныйНомер = Строка.ИнвНом;
		НМорозилка.ЗаводскойНомер = Строка.ЗавНом;  
		НМорозилка.ДатаВыпуска = Строка.Год;  
		НМорозилка.Записать();
	КонецЦикла;
	
	Сообщить("Готово");

КонецПроцедуры  

&НаСервере
Процедура СоздатьПриходникНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Морозилки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Морозилки КАК Морозилки
		|ГДЕ
		|	НЕ Морозилки.ПометкаУдаления";
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	
	НДок = Документы.ДвижениеМорозилок.СоздатьДокумент(); 
	НДок.Дата = ТекущаяДата();
	НДок.ВидОперации = Перечисления.ВидОперацииМорозилок.ПриходОтПоставщика;    
	НДок.ОткудаТип = Перечисления.ТипМестаМорозилок.Поставщик;
	НДок.ОткудаОбъект = Справочники.Партнеры.НайтиПоКоду("00-00000352");
	НДок.КудаТип = Перечисления.ТипМестаМорозилок.НашСклад;   
	НДок.КудаОбъект = Справочники.Склады.НайтиПоНаименованию("Склад_1");
		
	Пока Выборка.Следующий() Цикл
		нСтр = НДок.Морозилки.Добавить();  
		нСтр.Морозилка = Выборка.Ссылка;
	КонецЦикла;        
	
	НДок.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриходник(Команда)
	СоздатьПриходникНаСервере();  
	Сообщить("Готово");
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПередачу(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	ОписаниеОповещенияВозврата = Новый ОписаниеОповещения("СоздатьПередачуПосле", ЭтотОбъект); 
	
	СтруктураПараметров.Вставить("Заголовок", "Загрузка морозилок"""); 
	СтруктураПараметров.Вставить("Колонки", Новый Массив); 
	
	СписокПоЧемуИскатьМорозилку = Новый СписокЗначений;
	СписокПоЧемуИскатьМорозилку.Добавить("ЗаводскойНомер");  
	
	СписокПоЧемуИскатьПартнера = Новый СписокЗначений;
	СписокПоЧемуИскатьПартнера.Добавить("Наименование");
	
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения, ПоЧемуИскать", 
															"ЗаводскойНомер",
															Новый ОписаниеТипов("СправочникСсылка.Морозилки"),
															"ЗаводскойНомер",
															"ЗаводскойНомер",
															Истина,
															СписокПоЧемуИскатьМорозилку
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения, ПоЧемуИскать", 
															"Партнер",
															Новый ОписаниеТипов("СправочникСсылка.Партнеры"),
															"Партнер",
															"Партнер",
															Истина,
															СписокПоЧемуИскатьПартнера
														)
										);				 
										
										
	ЗагрузкаДанныхИзТаблицКлиент.ОткрытьФормуЗагрузкиИзТаблиц(СтруктураПараметров, ЭтаФорма, ОписаниеОповещенияВозврата);

КонецПроцедуры   

&НаКлиенте
Процедура СоздатьПередачуПосле(СтруктураПараметров, ДополнительныеПараметры) Экспорт  
	
	Если ЗначениеЗаполнено(СтруктураПараметров) Тогда 
		Адрес = СтруктураПараметров.АдресВременногоХранилищаТаблицы; 
		СоздатьПередачиНаСервере(Адрес);  	
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура СоздатьПередачиНаСервере(Адрес) 
	
	
	ТаблицаКЗагрузке = ПолучитьИзВременногоХранилища(Адрес); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.ЗаводскойНомер КАК Морозилка,
		|	Т.Партнер КАК Партнер
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Вт.Морозилка КАК Морозилка,
		|	Вт.Партнер КАК Партнер
		|ИЗ
		|	Вт КАК Вт
		|ИТОГИ ПО
		|	Партнер";
	
	Запрос.УстановитьПараметр("Т", ТаблицаКЗагрузке);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПартнер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПартнер.Следующий() Цикл
		
		Выборка = ВыборкаПартнер.Выбрать();
		
		НДок = Документы.ДвижениеМорозилок.СоздатьДокумент(); 
		НДок.Дата = ТекущаяДата();
		НДок.ВидОперации = Перечисления.ВидОперацииМорозилок.ПередачаКлиенту;    
		НДок.ОткудаТип = Перечисления.ТипМестаМорозилок.НашСклад;
		НДок.ОткудаОбъект = Справочники.Склады.НайтиПоНаименованию("Склад_1");
		НДок.КудаТип = Перечисления.ТипМестаМорозилок.Контрагент;   
		НДок.КудаОбъект = ВыборкаПартнер.Партнер;
		
		Пока Выборка.Следующий() Цикл
			нСтр = НДок.Морозилки.Добавить();  
			нСтр.Морозилка = Выборка.Морозилка;
		КонецЦикла;        
		
		НДок.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	Сообщить("Готово");

КонецПроцедуры
